leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.SIM.h
/*
 * S32K1xx.SIM.h
 *
 *  Created on: 2020年7月20日
 *      Author: Master.HE
 */

#ifndef S32K1XX_SIM_H_
#define S32K1XX_SIM_H_

#include "S32K1xx.Type.h"


typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADC_INTERLEAVE_EN				:4;
		__IO uint32_t CLKOUTSEL						:4;

		__IO uint32_t CLKOUTDIV						:3;
		__IO uint32_t CLKOUTEN						:1;
		__IO uint32_t TRACECLK_SEL					:1;
		__IO uint32_t PDB_BB_SEL					:1;
		__IO uint32_t								:2;

		__IO uint32_t ADC_SUPPLY					:3;
		__IO uint32_t ADC_SUPPLYEN					:1;
		__IO uint32_t SRAMU_RETEN					:1;
		__IO uint32_t SRAML_RETEN					:1;
		__IO uint32_t PDB_BB_SEL_1					:1;
		__IO uint32_t PDB_BB_SEL_2					:1;

		__IO uint32_t								:8;
	}BIT;
}SIM_CHIPCTL_Type;//??????

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:9;
		__IO uint32_t STOP1_MONITOR					:1;
		__IO uint32_t STOP2_MONITOR					:1;
		__IO uint32_t ECC_EEERAM_STAT				:1;
		__IO uint32_t ECC_MGRAM_STAT				:1;
		__IO uint32_t								:1;
		__IO uint32_t FTM_GTB_SPLIT_EN				:1;
		__IO uint32_t								:1;

		__IO uint32_t FTM0_OBE_CTRL					:1;
		__IO uint32_t FTM1_OBE_CTRL					:1;
		__IO uint32_t FTM2_OBE_CTRL					:1;
		__IO uint32_t FTM3_OBE_CTRL					:1;
		__IO uint32_t FTM4_OBE_CTRL					:1;
		__IO uint32_t FTM5_OBE_CTRL					:1;
		__IO uint32_t FTM6_OBE_CTRL					:1;
		__IO uint32_t FTM7_OBE_CTRL					:1;

		__IO uint32_t RMII_CLK_OBE					:1;
		__IO uint32_t RMII_CLK_SEL					:1;
		__IO uint32_t QSPI_CLK_SEL					:1;
		__IO uint32_t								:5;
	}BIT;
}SIM_MISCTRL0_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CGCMSCM						:1;
		__IO uint32_t CGCMPU						:1;
		__IO uint32_t CGCDMA						:1;
		__IO uint32_t CGCERM						:1;
		__IO uint32_t CGCEIM						:1;
		__IO uint32_t CGCGPIO						:1;
		__IO uint32_t								:2;

		__IO uint32_t								:24;
	}BIT;
}SIM_PLATCGC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FTM0FLTxSEL					:3;
		__IO uint32_t								:1;
		__IO uint32_t FTM1FLTxSEL					:3;
		__IO uint32_t								:1;

		__IO uint32_t FTM2FLTxSEL					:3;
		__IO uint32_t								:1;
		__IO uint32_t FTM3FLTxSEL					:3;
		__IO uint32_t								:1;

		__IO uint32_t FTM4CLKSEL					:2;
		__IO uint32_t FTM5CLKSEL					:2;
		__IO uint32_t FTM6CLKSEL					:2;
		__IO uint32_t FTM7CLKSEL					:2;

		__IO uint32_t FTM0CLKSEL					:2;
		__IO uint32_t FTM1CLKSEL					:2;
		__IO uint32_t FTM2CLKSEL					:2;
		__IO uint32_t FTM3CLKSEL					:2;
	}BIT;
}SIM_FTMOPT0_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t LPO1KCLKEN					:1;
		__IO uint32_t LPO32KCLKEN					:1;
		__IO uint32_t LPOCLKSEL						:2;
		__IO uint32_t RTCCLKSEL						:2;
		__IO uint32_t								:2;

		__IO uint32_t								:24;
	}BIT;
}SIM_LPOCLKS_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADC0TRGSEL					:1;
		__IO uint32_t ADC0SWPRETRG					:3;
		__IO uint32_t ADC0PRETRGSEL					:2;
		__IO uint32_t								:2;

		__IO uint32_t ADC1TRGSEL					:1;
		__IO uint32_t ADC1SWPRETRG					:3;
		__IO uint32_t ADC1PRETRGSEL					:2;
		__IO uint32_t								:2;

		__IO uint32_t								:16;
	}BIT;
}SIM_ADCOPT_Type;

/*
typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FTM0SYNCBIT					:1;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM_FTMOPT1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
		__IO uint32_t								:;
	}BIT;
}SIM__Type;

*/







/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */


/** SIM - Size of Registers Arrays */

/** SIM - Register Layout Typedef */
typedef struct {
	uint8_t RESERVED_0[4];
	SIM_CHIPCTL_Type CHIPCTL;                           /**< Chip Control register, offset: 0x4 */
	uint8_t RESERVED_1[4];
	SIM_FTMOPT0_Type FTMOPT0;                           /**< FTM Option Register 0, offset: 0xC */
	SIM_LPOCLKS_Type LPOCLKS;                           /**< LPO Clock Select Register, offset: 0x10 */
	uint8_t RESERVED_2[4];
	SIM_ADCOPT_Type ADCOPT;                            /**< ADC Options Register, offset: 0x18 */
	__IO uint32_t FTMOPT1;                           /**< FTM Option Register 1, offset: 0x1C */
	__IO uint32_t MISCTRL0;                          /**< Miscellaneous control register 0, offset: 0x20 */
	__I  uint32_t SDID;                              /**< System Device Identification Register, offset: 0x24 */
	uint8_t RESERVED_3[24];
	__IO uint32_t PLATCGC;                           /**< Platform Clock Gating Control Register, offset: 0x40 */
	uint8_t RESERVED_4[8];
	__IO uint32_t FCFG1;                             /**< Flash Configuration Register 1, offset: 0x4C */
	uint8_t RESERVED_5[4];
	__I  uint32_t UIDH;                              /**< Unique Identification Register High, offset: 0x54 */
	__I  uint32_t UIDMH;                             /**< Unique Identification Register Mid-High, offset: 0x58 */
	__I  uint32_t UIDML;                             /**< Unique Identification Register Mid Low, offset: 0x5C */
	__I  uint32_t UIDL;                              /**< Unique Identification Register Low, offset: 0x60 */
	uint8_t RESERVED_6[4];
	__IO uint32_t CLKDIV4;                           /**< System Clock Divider Register 4, offset: 0x68 */
	__IO uint32_t MISCTRL1;                          /**< Miscellaneous Control register 1, offset: 0x6C */
} SIM_Type, *SIM_MemMapPtr;

